In [1]:
import pandas as pd

In [2]:
carData=pd.read_csv("car-sales-missing-data.csv")

In [3]:
carData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

NaN=Not A Number . represent missing data

To deal with missing value

all NaN values are dropped but temporary

In [4]:
carData.dropna() # temporary

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [5]:
carData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [6]:
carData.dropna(inplace=True) # permanent change

In [7]:
carData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [8]:
carData=pd.read_csv("car-sales-missing-data.csv")

In [9]:
carData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [10]:
carData=carData.dropna()

In [11]:
carData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500

In [12]:
carData=pd.read_csv("car-sales-missing-data.csv")

count Null values

In [13]:
carData.isna()

    Make  Colour  Odometer  Doors  Price
0  False   False     False  False  False
1  False   False     False  False  False
2  False   False      True  False  False
3  False   False     False  False  False
4  False   False     False  False  False
5  False   False      True  False  False
6  False    True      True  False  False
7  False   False      True  False   True
8  False   False     False   True   True
9   True   False     False  False  False

In [14]:
carData.isna().sum()

Make        1
Colour      1
Odometer    4
Doors       1
Price       2
dtype: int64

In [15]:
carData['Odometer'].isna().sum()

4

fill null value

In [16]:
carData

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [17]:
carData['Colour'].fillna('Orange',inplace=True)

In [18]:
carData['Make'].fillna('Honda',inplace=True)

In [19]:
carData

     Make  Colour  Odometer  Doors    Price
0  Toyota   White  150043.0    4.0   $4,000
1   Honda     Red   87899.0    4.0   $5,000
2  Toyota    Blue       NaN    3.0   $7,000
3     BMW   Black   11179.0    5.0  $22,000
4  Nissan   White  213095.0    4.0   $3,500
5  Toyota   Green       NaN    4.0   $4,500
6   Honda  Orange       NaN    4.0   $7,500
7   Honda    Blue       NaN    4.0      NaN
8  Toyota   White   60000.0    NaN      NaN
9   Honda   White   31600.0    4.0   $9,700

mean of odometer

In [20]:
carData['Odometer'].mean()

92302.66666666667

In [21]:
carData['Odometer'].fillna(carData['Odometer'].mean(),inplace=True)

In [22]:
carData.fillna({'Odometer':carData['Odometer'].mean()},inplace=True)
carData

     Make  Colour       Odometer  Doors    Price
0  Toyota   White  150043.000000    4.0   $4,000
1   Honda     Red   87899.000000    4.0   $5,000
2  Toyota    Blue   92302.666667    3.0   $7,000
3     BMW   Black   11179.000000    5.0  $22,000
4  Nissan   White  213095.000000    4.0   $3,500
5  Toyota   Green   92302.666667    4.0   $4,500
6   Honda  Orange   92302.666667    4.0   $7,500
7   Honda    Blue   92302.666667    4.0      NaN
8  Toyota   White   60000.000000    NaN      NaN
9   Honda   White   31600.000000    4.0   $9,700

In [23]:
carData['Odometer']=carData['Odometer'].fillna(carData['Odometer'].mean())

In [24]:
carData

     Make  Colour       Odometer  Doors    Price
0  Toyota   White  150043.000000    4.0   $4,000
1   Honda     Red   87899.000000    4.0   $5,000
2  Toyota    Blue   92302.666667    3.0   $7,000
3     BMW   Black   11179.000000    5.0  $22,000
4  Nissan   White  213095.000000    4.0   $3,500
5  Toyota   Green   92302.666667    4.0   $4,500
6   Honda  Orange   92302.666667    4.0   $7,500
7   Honda    Blue   92302.666667    4.0      NaN
8  Toyota   White   60000.000000    NaN      NaN
9   Honda   White   31600.000000    4.0   $9,700

In [25]:
carData['Doors'].fillna(4,inplace=True)

In [26]:
carData

     Make  Colour       Odometer  Doors    Price
0  Toyota   White  150043.000000    4.0   $4,000
1   Honda     Red   87899.000000    4.0   $5,000
2  Toyota    Blue   92302.666667    3.0   $7,000
3     BMW   Black   11179.000000    5.0  $22,000
4  Nissan   White  213095.000000    4.0   $3,500
5  Toyota   Green   92302.666667    4.0   $4,500
6   Honda  Orange   92302.666667    4.0   $7,500
7   Honda    Blue   92302.666667    4.0      NaN
8  Toyota   White   60000.000000    4.0      NaN
9   Honda   White   31600.000000    4.0   $9,700

In [27]:
carData

     Make  Colour       Odometer  Doors    Price
0  Toyota   White  150043.000000    4.0   $4,000
1   Honda     Red   87899.000000    4.0   $5,000
2  Toyota    Blue   92302.666667    3.0   $7,000
3     BMW   Black   11179.000000    5.0  $22,000
4  Nissan   White  213095.000000    4.0   $3,500
5  Toyota   Green   92302.666667    4.0   $4,500
6   Honda  Orange   92302.666667    4.0   $7,500
7   Honda    Blue   92302.666667    4.0      NaN
8  Toyota   White   60000.000000    4.0      NaN
9   Honda   White   31600.000000    4.0   $9,700

In [45]:
carData1=pd.read_csv("car-sales-missing-data.csv")

In [46]:
carData1

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

In [37]:
#Lets try to convert  price into proper format

In [38]:
#use split or either use replace for this
#Example
for i in carData1['Price']:
    if(type(i)!=float):
        i,j=i[1:].split(",")
        print(i+j)

4000
5000
7000
22000
3500
4500
7500
9700

In [32]:
newPrice = [int(data.replace("$", "").replace("," , "")) if type(data)!= float else None for data in carData1['Price']]

In [33]:
carData1['Price']=newPrice # since there were missing value and pandas convert whole price in float .int64 cannot store NaN

In [34]:
carData1

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   4000.0
1   Honda    Red   87899.0    4.0   5000.0
2  Toyota   Blue       NaN    3.0   7000.0
3     BMW  Black   11179.0    5.0  22000.0
4  Nissan  White  213095.0    4.0   3500.0
5  Toyota  Green       NaN    4.0   4500.0
6   Honda    NaN       NaN    4.0   7500.0
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   9700.0